Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S16B.atdf
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCCLK" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCCLK" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCCLK" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCCLK" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCCLK" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCCLK" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCCLK" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCCLK" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCCLK" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCCLK" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCCLK" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCCLK" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCCLK" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCCLK" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCCLK" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCCLK" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SETTLING">
        <value caption="3 periods of ADCCLK" name="AST3" value="0x0"/>
        <value caption="5 periods of ADCCLK" name="AST5" value="0x1"/>
        <value caption="9 periods of ADCCLK" name="AST9" value="0x2"/>
        <value caption="17 periods of ADCCLK" name="AST17" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_MR__ANACH">
        <value caption="No analog change on channel switching: DIFF0, GAIN0 and OFF0 are used for all channels." name="NONE" value="0"/>
        <value caption="Allows different analog settings for each channel. See ADC_CGR and ADC_COR registers." name="ALLOWED" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert the same channel several times." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN0">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN1">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN2">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN3">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN4">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN5">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN6">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_CGR__GAIN7">
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)" name="SE1_DIFF0_5" value="0x0"/>
        <value caption="Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)" name="SE1_DIFF1" value="0x1"/>
        <value caption="Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE2_DIFF2" value="0x2"/>
        <value caption="Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)" name="SE4_DIFF2" value="0x3"/>
      </value-group>
