Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S16B.atdf
        <register caption="Parallel Capture Mode Register" name="PIO_PCMR" offset="0x0150" rw="RW" size="4">
          <bitfield caption="Parallel Capture Mode Enable" mask="0x00000001" name="PCEN"/>
          <bitfield caption="Parallel Capture Mode Data Size" mask="0x00000030" name="DSIZE" values="PIO_PCMR__DSIZE"/>
          <bitfield caption="Parallel Capture Mode Always Sampling" mask="0x00000200" name="ALWYS"/>
          <bitfield caption="Parallel Capture Mode Half Sampling" mask="0x00000400" name="HALFS"/>
          <bitfield caption="Parallel Capture Mode First Sample" mask="0x00000800" name="FRSTS"/>
        </register>
        <register caption="Parallel Capture Interrupt Enable Register" name="PIO_PCIER" offset="0x0154" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Enable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Enable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Enable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Disable Register" name="PIO_PCIDR" offset="0x0158" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Disable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Disable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Disable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Mask Register" name="PIO_PCIMR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Mask" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Mask" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Mask" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Status Register" name="PIO_PCISR" offset="0x0160" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error" mask="0x00000002" name="OVRE"/>
          <bitfield mask="0x00000004" name="ENDRX"/>
          <bitfield mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Reception Holding Register" name="PIO_PCRHR" offset="0x0164" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Reception Data" mask="0xFFFFFFFF" name="RDATA"/>
        </register>
        <register caption="Receive Pointer Register" name="PIO_RPR" offset="0x168" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PIO_RCR" offset="0x16C" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PIO_RNPR" offset="0x178" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PIO_RNCR" offset="0x17C" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PIO_PTCR" offset="0x188" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PIO_PTSR" offset="0x18C" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
      <value-group caption="" name="PIO_PCMR__DSIZE">
        <value caption="The reception data in the PIO_PCRHR is a byte (8-bit)" name="BYTE" value="0x0"/>
        <value caption="The reception data in the PIO_PCRHR is a half-word (16-bit)" name="HALFWORD" value="0x1"/>
        <value caption="The reception data in the PIO_PCRHR is a word (32-bit)" name="WORD" value="0x2"/>
      </value-group>
    </module>
    <module caption="Power Management Controller" name="PMC" version="11116V">
      <register-group name="PMC">
        <register caption="System Clock Enable Register" name="PMC_SCER" offset="0x0000" rw="W" size="4">
          <bitfield caption="USB Device Port Clock Enable" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Enable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Enable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Enable" mask="0x00000400" name="PCK2"/>
        </register>
        <register caption="System Clock Disable Register" name="PMC_SCDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="USB Device Port Clock Disable" mask="0x00000080" name="UDP"/>
          <bitfield caption="Programmable Clock 0 Output Disable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Disable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Disable" mask="0x00000400" name="PCK2"/>
        </register>
